{"site":{"posts":[{"draft":false,"categories":[],"layout":"post","date":"2022-02-25 07:30:00 -0700","title":"How a reverse osmosis system works","description":"The science behind a popular solution for filtering drinking water.","tags":["education","filtered water"],"image":"/uploads/water-softening-3.jpeg","slug":"how-a-reverse-osmosis-system-works","ext":".md","excerpt":"<p>Reverse osmosis or RO is a filtration method that is used to remove ions and molecules from a solution by applying pressure to the solution on one side of a semipermeable or selective membrane. Large molecules (solute) can’t cross the membrane, so they remain on one side. Water (solvent) can cross the membrane. The result is that solute molecules become more concentrated on one side of the membrane, while the opposite side becomes more dilute.</p>\n","content":"<p>Reverse osmosis or RO is a filtration method that is used to remove ions and molecules from a solution by applying pressure to the solution on one side of a semipermeable or selective membrane. Large molecules (solute) can’t cross the membrane, so they remain on one side. Water (solvent) can cross the membrane. The result is that solute molecules become more concentrated on one side of the membrane, while the opposite side becomes more dilute.</p>\n\n<h2 id=\"how-reverse-osmosis-works\">How Reverse Osmosis Works </h2>\n\n<p>In order to understand reverse osmosis, it helps to first understand how mass is transported via diffusion and regular osmosis. Diffusion is the movement of moleculesfrom a region of higher concentration to a region of lower concentration. Osmosis is a special case of diffusion in which the molecules are water and the concentration gradient occurs across a semipermeable membrane. The semipermeable membrane allows the passage of water, but notions (e.g., Na+, Ca2+, Cl-) or larger molecules (e.g., glucose, urea, bacteria). Diffusion and osmosis are thermodynamically favorable and will continue until equilibrium is reached. Osmosis can be slowed, stopped, or even reversed if sufficient pressure is applied to the membrane from the ‘concentrated’ side of the membrane.</p>\n\n<p>Reverse osmosis occurs when the water is moved across the membrane <em>against the concentration gradient</em>, from lower concentration to higher concentration. To illustrate, imagine a semipermeable membrane with fresh water on one side and a concentrated aqueous solution on the other side. If normal osmosis takes place, the fresh water will cross the membrane to dilute the concentrated solution. In reverse osmosis, pressure is exerted on the side with the concentrated solution to force the water molecules through the membrane to the freshwater side.</p>\n\n<p>There are different pore sizes of membranes used for reverse osmosis. While a small pore size does a better job of filtration, it takes longer to move water. It’s sort of like trying to pour water through a strainer (large holes or pores) compared to trying to pour it through a paper towel (smaller holes). However, reverse osmosis is different from simple membrane filtration because it involves diffusion and is affected by flow rate and pressure.</p>\n\n<h2 id=\"uses-of-reverse-osmosis\">Uses of Reverse Osmosis </h2>\n\n<p>Reverse osmosis is often used in commercial and residential water filtration. It is also one of the methods used to desalinate seawater. Reverse osmosis not only reduces salt, but can also filter out metals, organic contaminants, and pathogens. Sometimes reverse osmosis is used to purify liquids in which water is an undesirable impurity. For example, reverse osmosis can be used to purify ethanol or grain alcohol to increase its proof.</p>\n\n<h2 id=\"history-of-reverse-osmosis\">History of Reverse Osmosis </h2>\n\n<p>Reverse osmosis is not a new purification technique. The first examples of osmosis through semipermeable membranes was described by Jean-Antoine Nollet in 1748. While the process was known in laboratories, it wasn’t used for desalination of seawater until 1950 at the University of California in Los Angeles. Multiple researchers refined methods of using reverse osmosis to purify water, but the process was so slow that it wasn’t practical on a commercial scale. New polymers allowed for the production of more efficient membranes. By the beginning of the 21st century, desalination plants became capable of desalinating water at the rate of 15 million gallons per day, with around 15,000 plants in operation or planned.</p>\n\n<p>Article Source:</p>\n\n<p>Helmenstine, Anne Marie, Ph.D. “How Reverse Osmosis Works.” ThoughtCo, Aug. 27, 2020, thoughtco.com/reverse-osmosis-overview-609400</p>\n","url":"/news/how-a-reverse-osmosis-system-works","relative_path":"_posts/2022-02-25-how-a-reverse-osmosis-system-works.md","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2022-03-07 05:01:35 -0700","title":"Water softeners vs water conditioners","description":"Learn the difference between a traditional water softening system compared to new salt-free systems like Nuvo Home.","tags":["education","soft water"],"image":"/uploads/water-softening-2.png","slug":"water-softeners-vs-water-conditioners","ext":".md","excerpt":"<p>Water softening and water conditioning are two terms that are thrown around a lot the water treatment industry. However, many people do not understand the difference between the two.</p>\n","content":"<p>Water softening and water conditioning are two terms that are thrown around a lot the water treatment industry. However, many people do not understand the difference between the two.</p>\n\n<p>It is very important you fully understand the difference between a water softener and a water conditioner before you get one installed. Without the proper knowledge, you may end up with a water treatment system that doesn’t fit your home or business’ needs.</p>\n\n<h2 id=\"water-softener-vs-water-conditioner\">Water Softener vs Water Conditioner</h2>\n\n<p>First, let’s cover what a water softener and a water conditioner will do for your water.</p>\n\n<p>A water softener will:</p>\n\n<ul>\n  <li>Remove calcium and magnesium (hardness particles) from your water supply</li>\n  <li>Reduce or eliminate scale build-up in appliances and pipes</li>\n  <li>Reduce soap and detergent usage</li>\n  <li>Reduce dry skin after washing</li>\n</ul>\n\n<p>A water conditioner will:</p>\n\n<ul>\n  <li>Change the chemistry of hardness particles for a certain amount of time</li>\n  <li>Reduce scale build up in plumbing for a certain amount of time</li>\n  <li>Removes additional chemicals, like chlorine, from water</li>\n  <li>Waste less water than a water softener</li>\n</ul>\n\n<p>Now that we have a better idea of what each of these will do. Let’s cover what they won’t do.</p>\n\n<p>A water softener won’t:</p>\n\n<ul>\n  <li>Remove additional harmful chemicals like chlorine, herbicides, and pesticides</li>\n  <li>Remove viruses or bacteria from water</li>\n  <li>Make tap water healthier to drink</li>\n</ul>\n\n<p>A water conditioner won’t:</p>\n\n<ul>\n  <li>Remove hardness particles from the water</li>\n  <li>Keep scale build-up from your appliances, dishes, shower, and bathtub</li>\n  <li>Lower TDS (total dissolved solids) in your water</li>\n</ul>\n\n<h2 id=\"how-does-a-water-softener-work\">How does a water softener work?</h2>\n\n<p>A water softener works by actually removing the hardness particles (like calcium and magnesium) from your water supply. This is done through a process called ion-exchange.</p>\n\n<p>In the water softener tank, there is a bed full of resin. Resin are tiny little plastic beads that hold sodium ions. As hard water flows through the resin, hard water particles stick to the resin beads and are replaced with sodium.</p>\n\n<p>Sodium is a soft mineral that won’t cluster or scale in plumbing, appliances, dishes or your skin. There is a myth that soft water is unhealthy to drink because it contains a lot of sodium. However, in reality, the amount of sodium that is added is less than a slice of bread.</p>\n\n<p>Once the resin is full of hard water particles they must be backwashed (or regenerated). The regeneration process takes salt water from the brine tank and washes it over the resin. This washes the hard water particles off the resin and replaces it with sodium again. Regeneration typically happens every 2-10 days depending on the size of the water softener.</p>\n\n<h2 id=\"how-does-a-water-conditioner-work\">How does a water conditioner work?</h2>\n\n<p>Unlike a water softener, a water conditioner does not remove hardness particles from your water supply. It “conditions” water and changes the chemistry of the particles for a certain amount of time to keep it from building up.</p>\n\n<p>“Water conditioner” is a broad term for a wide variety of products and technologies. Here are the most common types of water conditioners.</p>\n\n<ul>\n  <li><strong>Electrically induced precipitation</strong> uses a direct electrical current to precipitate water hardness and other compounds.  The hardness precipitate forms on an electrode that must be cleaned periodically. Some studies have shown that precipitate forms a soft sludge on surfaces, such as a heating element, that is easily removable by fast-flowing water near the surface.</li>\n  <li><strong>Electrochemical water treatment systems</strong> induce the removal of dissolved hardness minerals and other contaminants using electricity. The technology goes by several names: continuous electrolytic deionization, capacitive deionization or electrically regenerated ion exchange. The introduction of a negatively charged electrode, or cathode, into the water will cause positively charged cations to move towards it.</li>\n  <li><strong>Template-assisted crystallization</strong> uses surface-treated resin beads to convert (not remove) dissolved hardness ions to microscopic scale-resistant crystals.  The polymeric beads are fluidized creating agitation that releases the microscopic crystals and allows for further formation of crystals. Once these crystals are formed and released from the beads, they are insoluble particles that will not form scale on surfaces.</li>\n  <li><strong>Magnetic water treatment</strong>, or the use of magnets and electromagnetic devices for water treatment, is a controversial method.  The approach is to pass the hard water through a magnetic field in order to form microscopic precipitates that do not form scale on water heaters, pipes, and other plumbing fixtures.   There is no scientific consensus as to the effectiveness of magnetic water treatment and as to its removal mechanisms. Thus magnetic water treatment, unlike the other technologies described above, should be regarded as an unproven technology.</li>\n</ul>\n\n<h2 id=\"how-effective-is-a-water-conditioner\">How effective is a water conditioner?</h2>\n\n<p>Water conditioners range greatly in their effectiveness. Some claim they are over 90% effective in stopping clustering or build up in plumbing.</p>\n\n<p>However, there are multiple reports and reviews that the products don’t live up to consumers’ expectations. It is recommended that consumers should carefully investigate product claims prior to making a purchase of a specific device.</p>\n\n<h2 id=\"what-about-salt-free-water-softeners\">What about “salt-free” water softeners?</h2>\n\n<p>A technology that has been thrown around the internet that has a lot of people curious is a “salt-free water softener”.</p>\n\n<p>The truth is, there is no such thing as a salt-free water softener. What they are actually mistakingly referring to is a water conditioner.</p>\n\n<p>Without sodium, you cannot soften water. That is a scientific fact. So, while a salt-free water conditioner can change particles for a certain amount of time, the water is still hard and will revert back to hard water at some point.</p>\n\n<h2 id=\"should-i-get-a-water-softener-or-water-conditioner\">Should I get a water softener or water conditioner?</h2>\n\n<p>There are pros and cons to both water treatment systems. However, we always recommend a water softener over a water conditioner because it will actually remove the hardness particles from your water and is also far more effective. It also has added benefits of keeping hardness particles off your appliances, your clothes, your skin, and will reduce soap and detergent usage.</p>\n\n<p>If you are concerned about other contaminants or sodium in your drinking water you can always add a filter or reverse osmosis system. Installing these systems after your water softener will remove things like sodium, iron, chlorine, and more from your drinking water.</p>\n\n<p>One thing you should not consider is using both systems. Using a water conditioner before a water softener will change the hardness particles making the ion-exchange in a water softener ineffective. Conversely, using a water softener before a water conditioner will remove the hardness particles leaving the water conditioner mostly useless.</p>\n\n<p>Contact us today to learn more about getting the right water treatment system for your home or business.</p>\n\n<p>Article Source:</p>\n\n<p>Weber, Aaron “The Differences Between Water Softening and Water Conditioning” Hill Water Conditioning, Jan. 21, 2020, https://www.hillwater.com/blog/p-8-water-softener-vs-water-conditioner.aspx</p>\n","url":"/news/water-softeners-vs-water-conditioners","relative_path":"_posts/2022-03-07-water-softeners-vs-water-conditioners.md","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2022-03-08 12:26:35 -0700","title":"Storage tank vs tankless water heaters","description":"Tankless water heaters are gaining popularity in recent years... but is going tankless the correct choice for your situation?","tags":["education","hot water"],"image":"/uploads/water-heating-2.jpg","slug":"storage-tank-vs-tankless-water-heaters","ext":".md","excerpt":"<p>If you pore over the energy bill each and every month but rarely give a thought to your water heater, you’re missing something critical: there’s a direct relationship between the two.  Believe it or not, the average household devotes more than a quarter of its total annual energy spending to the water heater alone, which means that the water heater is more expensive to run than almost any other home appliance—only heating and cooling cost more.</p>\n","content":"<p>If you pore over the energy bill each and every month but rarely give a thought to your water heater, you’re missing something critical: there’s a direct relationship between the two.  Believe it or not, the average household devotes more than a quarter of its total annual energy spending to the water heater alone, which means that the water heater is more expensive to run than almost any other home appliance—only heating and cooling cost more.</p>\n\n<p>Under the circumstances it literally pays to weigh the options and crunch the numbers before purchasing a replacement water heater.  The good news is that, largely in response to consumer demand, manufacturers now offer a range of water-heating technologies designed to maximize efficiency and minimize ongoing costs.  As a result it’s a good time to be in the market but given the busy landscape, it’s also a confusing one.</p>\n\n<p>Make no mistake: if you’ve had the same water heater for a decade, you’re probably spending more than is strictly necessary for essential daily tasks like bathing, laundry, and dishwashing.  But while upgrading to almost any brand-new, energy-smart water heater would save you money on your monthly utility bill, it would be foolish to choose your next unit blindly.  Why?  Efficiency matters, yes—but operating costs make up only part of the value equation.  It’s also critical to assess the purchase and installation costs of a new water heater.  So if you’re surveying a field of water heaters, all of which are more efficient than your current model, settling on just one requires figuring out which would do the most for your bottom line over the long term.</p>\n\n<p>Of course to be in a position to pick one model above the others, you must first narrow in on the type of water heater you want.  Other options exist, but homeowners typically consider only two technologies—conventional storage tank water heaters on the one hand and innovative tankless water heaters on the other.</p>\n\n<h2 id=\"storage-tank-water-heaters\">STORAGE TANK WATER HEATERS</h2>\n\n<p>According to Daniel O’Brian, a technical specialist with us at <a href=\"https://supplyhouse.com/\">SupplyHouse.com</a>, “traditional tank-style water heaters are far and away the most commonly used.”  Uncomplicated, unfussy, and deeply familiar to their installers and repairmen, storage tank water heaters remain in use in part because old habits die hard in the building industry, but also because this tried-and-true technology has reliably served generations of homeowners.</p>\n\n<p>Whether powered by natural gas, electricity, propane, or oil, storage water heaters function in pretty much the same way.  The unit heats and reheats a volume of water stored within an insulated tank (typical residential tank sizes range from 20 to 80 gallons).  When a plumbing fixture or water-using appliance calls for it, hot water exits the tank from the top, while cold water enters from the bottom to replenish the tank.</p>\n\n<p><em>Efficiency:</em>  Conventional water heaters operate around the clock, whether you need hot water or not.  Sounds inefficient, right?  It is.  When water in the tank cools down below a certain threshold, the appliance reheats the same water, effectively wasting energy in the process.  That said, with more insulation and less standby heat loss, tank-style units now waste a lot less energy than they used to.  Some even boast an Energy Star rating!</p>\n\n<p><em>Installation:</em>  “If you have a gas water heater and you’re replacing it with a gas water heater, you can expect installation to cost about as much as the unit itself” O’Brian says.  Switching from one fuel type to another—say, from electric to gas—inevitably adds complexity and cost, but not as much as you might think.  The reason?  Storage tank water heaters don’t usually require any wiring or piping modifications.</p>\n\n<p><em>Performance:</em>  There’s one chief complaint levied against storage units: because their tanks are finite and their water-heating process isn’t instantaneous, it’s possible to run out of hot water temporarily.  As O’Brian points out, “if you always seem to be running out of hot water, that suggests you need a bigger unit.”  In other words, so long as it’s properly sized to meet peak demand, a tank-style unit doesn’t run out.</p>\n\n<h2 id=\"tankless-water-heaters\">TANKLESS WATER HEATERS</h2>\n\n<p>Tankless water heating isn’t new per se.  Just look at the point-of-use tankless heaters that have been popular for many years, especially in Europe and Asia.  In the United States, tankless, whole-house water heating caught on only relatively recently.  But now more and more manufacturers seem to be producing more and more tankless units—and the professional service community has adapted—all to accommodate rising homeowner demand.</p>\n\n<p>Dramatically smaller than traditional water heaters—small enough to mount on the wall—tankless units live up to their name.  Rather than constantly maintaining a standby supply of hot water, they heat water “on demand,” as O’Brian puts it.  Cold water enters the tankless unit then exits a split second later, fully heated to the target temperature by either a gas burner or electric resistance heating coils.</p>\n\n<p><em>Efficiency:</em>  By virtue of their clever design, tankless water heaters operate up to around 30 percent more efficiently than their tank-style cousins.  Wow!  But note that tankless units command a premium price, double or even triple that of conventional units.  In other words, before a tankless unit starts saving you money, its efficient operation needs to make up for its elevated up-front cost.</p>\n\n<p><em>Installation:</em>  In addition to being more expensive up front, tankless water heaters also cost more to install.  “Think of it this way,” O’Brian says, “when you’re installing a conventional unit, you’re typically hooking it up to the home as is.  But when you install a tankless unit, modifications must be made.”  The upshot?  Tankless installation costs can be double the price of a traditional water heater.</p>\n\n<p><em>Performance:</em>  If the tank in a conventional water heater places a limit on output, then units without tanks promise limitless hot water.  Complicating matters is that, as O’Brian puts it, “Never running out of hot water isn’t the same as always having enough of it.”  If demand spikes—if you hop in the shower at the same time that the dishwasher’s running—the relatively low flow rate of a tankless water heater may not be able to keep pace.</p>\n\n<p>Choosing the right water heater for your home and your family ultimately involves weighing a surprising number and range of considerations—”everything from how much water you use to how long you plan to stay in the home,” O’Brian says.  Which type of water heater delivers better energy efficiency?  That’s easy—tankless.  Which would be the most cost-effective choice in your situation?  Well, that’s a much harder question to answer.  “Unless you do the math,” O’Brian concludes, “you won’t know for sure.”</p>\n\n<p>Article Source:</p>\n\n<p>SupplyHouse.com in collaboration with BobVila.com, “Solved! Storage Tank vs. Tankless Water Heaters”, October 5, 2017, https://blog.supplyhouse.com/solved-storage-tank-vs-tankless-water-heaters</p>\n","url":"/news/storage-tank-vs-tankless-water-heaters","relative_path":"_posts/2022-03-08-storage-tank-vs-tankless-water-heaters.md","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2022-03-08 13:00:00 -0700","title":"We're hiring!","description":"Imlay Plumbing is looking for dedicated people to join its growing team.","tags":["jobs"],"image":"/uploads/now-hiring.png","slug":"were-hiring","ext":".md","excerpt":"<p>Imlay Plumbing &amp; Imlay Excavation are looking to fill the following positions:</p>\n","content":"<p>Imlay Plumbing &amp; Imlay Excavation are looking to fill the following positions:</p>\n\n<ul>\n  <li>Laborers</li>\n  <li>Licensed Plumbers</li>\n  <li>Equipment Operators</li>\n</ul>\n\n<p>Pay is depending on experience. We offer health benefit options and a great company culture. We prioritize doing the job right and offer great opportunities to learn.</p>\n\n<p>If you or someone you know is interested, stop by our office to pick up an application. Our office is located at <a href=\"https://goo.gl/maps/Mzhg1aPNp7tosZn4A\">779 N 2325 W</a> in Cedar City, Utah and our office staff can be reached at <a href=\"tel:+14355905236\">435-590-5236</a>.</p>\n","url":"/news/were-hiring","relative_path":"_posts/2022-03-09-were-hiring.md","permalink":null}],"pages":[{"draft":false,"categories":[],"layout":"default","title":"About Us","content_blocks":[{"_bookshop_name":"page-heading","title":"About","description":null},{"_bookshop_name":"page-image","image":"/uploads/about-hero.jpg","image_alt":"About Imlay Plumbing"},{"_bookshop_name":"content","content_html":"<p>Imlay Plumbing caters to both residential and commercial clients. We were founded with the goal to be a one-stop shop for all your goals. We are equipped to handle any kind of project, including service, remodels, new construction. We are also now offering excavation and electrical services as well!</p><p>We&rsquo;ve served Iron County and the surrounding areas for over 20 years. We provide a wide range of services for both residential and commercial clients. Our professional team is ready to handle any emergency plumbing need that may arise.</p><ul><li>Talented team</li><li>Competitive pricing</li><li>Quick service</li><li>Locally Owned &amp; Operated</li><li>24/7/365 Service</li><li>Quality Service Guaranteed!</li></ul><p>We serve Iron County Utah and all surrounding areas including: Cedar City, Parowan, Summit, New Harmony, St. George, Beaver, Duck Creek, Brian Head, Panguitch, Kanab, and more.</p>"},{"_bookshop_name":"team-section","title":"Our Team","description_html":"<p>Our team is what sets us apart from other contractors. Each individual serves a critical role in delivering a positive experience for our customers. We ensure every employee receives the proper licensing and education to make them successful in their position and achieve their career goals!</p>","show_team":true},{"_bookshop_name":"newsletter","newsletter_title":"Join our mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}],"slug":"about","ext":".html","tags":[],"excerpt":"","date":"2022-03-08 20:20:21 -0700","content":"","url":"/about/","relative_path":"_pages/about.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Contact","content_blocks":[{"_bookshop_name":"page-heading","title":"Contact","description":"If you have any questions or comments about our services, call us at 435-590-5236 or send a message using the form below."},{"_bookshop_name":"page-image","image":"/uploads/contact-hero.jpg","image_alt":"Contact Imlay Plumbing"},{"_bookshop_name":"content","content_html":"<h2>Company Contact</h2><p>Call:&nbsp;<a href=\"tel:+14355905236\">435-590-5236</a></p><p>Email:&nbsp;<a href=\"mailto:office@imlayplumbing.com\">office@imlayplumbing.com</a></p><p>Office Address:&nbsp;<a target=\"_blank\" rel=\"noopener\" href=\"https://goo.gl/maps/v4axBubUQGKDsDTY8\">779 N 2325 W, Cedar City, UT</a></p>"},{"_bookshop_name":"contact-form","form_title":"Send a Message","form_description":"Send us a message to get on the schedule, ask plumbing questions, or request a free estimate!","form_success_page":"/contact","form_submission_email":"office@imlayplumbing.com","form_button_text":"Send Now"},{"_bookshop_name":"newsletter","newsletter_title":"Join our mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}],"slug":"contact","ext":".html","tags":[],"excerpt":"","date":"2022-03-08 20:20:21 -0700","content":"","url":"/contact/","relative_path":"_pages/contact.html","permalink":null},{"draft":false,"categories":[],"layout":"default","permalink":"/","title":"Home","content_blocks":[{"_bookshop_name":"hero","title":"Quality Service Guaranteed!","description_html":"<p>When you need a plumber that will get the job done right the first time (at a price that won't break the bank) call the experts at Imlay Plumbing.</p><p>&nbsp;</p><p>Our team of licensed plumbers are trained to handle any&nbsp;<strong>residential</strong> or&nbsp;<strong>commercial</strong> plumbing jobs. Kadin Imlay and his team deliver quality, professional services every time they are called upon.</p>","image":"/uploads/home-hero.jpg","image_alt":"Imlay Plumbings Leadership","cta_button":"Contact Us","cta_button_link":"#contact","works_button":"See Our Services","works_button_link":"#services"},{"_bookshop_name":"services-section","title":"Services Offered","description_html":"<p>We lead the way in plumbing services for Iron County and offer a wide range of services for both residential and commercial clients.</p>","link_url":"/services","show_services":true},{"_bookshop_name":"testimonials-section","title":"Satisfied Clients","description_html":"<p>We are an award winning company with over 20 years in business and a passionate customer base. We love our clients and they love our work.</p>","show_testimonials":true},{"_bookshop_name":"team-hero","title":"Our Team","description_html":"<p>Our team is what sets us apart from other contractors. Each individual serves a critical role in delivering a positive experience for our customers. We ensure every employee receives the proper licensing and education to make them successful in their position and achieve their career goals!</p>","image":"/uploads/our-team.jpg","image_alt":"Imlay Plumbing team photo","link_url":"/about#team"},{"_bookshop_name":"news-section","title":"Recent Posts","description_html":"<p>Follow us for company news, plumbing advice, project updates, and more!</p>","link_url":"/news","show_posts":true},{"_bookshop_name":"newsletter","newsletter_title":"Join our mailing list","newsletter_description":"Get offers, updates and, giveaways!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"},{"_bookshop_name":"contact-form","form_title":"Contact Us","form_description":"Send us a message to get on the schedule, ask plumbing questions, or request a free estimate!","form_submission_email":"dhniels@me.com","form_button_text":"Send now"}],"slug":"index","ext":".html","tags":[],"excerpt":"","date":"2022-03-08 20:20:21 -0700","content":"","url":"/","relative_path":"_pages/index.html"},{"draft":false,"categories":[],"layout":"default","title":"News","content_blocks":[{"_bookshop_name":"page-heading","title":"News","description":"The latest news, plumbing advice, and tips from Imlay Plumbing"},{"_bookshop_name":"posts-list","show_posts":true},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}],"slug":"news","ext":".html","tags":[],"excerpt":"","date":"2022-03-08 20:20:21 -0700","content":"","url":"/news/","relative_path":"_pages/news.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Services","content_blocks":[{"_bookshop_name":"page-heading","title":"Services Offered","description":"No job is too big or too small! When it comes to plumbing we are your one stop shop for residential and commercial projects."},{"_bookshop_name":"services-list","show_services":true},{"_bookshop_name":"contact-form","form_title":"Request an estimate","form_description":"Send us a message with your project or with questions about our services. We offer free estimates!","form_success_page":"/services","form_submission_email":"office@imlayplumbing.com","form_button_text":"Send now"}],"slug":"services","ext":".html","tags":[],"excerpt":"","date":"2022-03-08 20:20:21 -0700","content":"","url":"/services/","relative_path":"_pages/services.html","permalink":null}],"services":[{"draft":false,"categories":[],"layout":"service","date":"2021-01-04 19:20:35 -0700","title":"General Plumbing","subtitle":"We repair and replace faucets, toilets, fixtures, and other plumbing fixtures. We can find and repair leaks, slow drains, and other general plumbing issues!","image":"/uploads/general-plumbing-1.jpg","slug":"general-plumbing","ext":".md","tags":[],"excerpt":"<h1 id=\"general-plumbing-services\">General Plumbing Services</h1>\n","content":"<h1 id=\"general-plumbing-services\">General Plumbing Services</h1>\n\n<p>Imlay Plumbing takes an exacting approach for perfection. Not all plumbing companies can guarantee quality results. Our plumbers will go the extra mile to fix any plumbing problem so you can enjoy your home again. From installing faucets and fixtures, repairing sump pumps, running gas lines, to fixing leaks; our plumbers are equipped with the tools, training, and backed by a full-time parts &amp; warehouse crew so the job gets done efficiently and with excellence.</p>\n\n<p><img src=\"/uploads/general-plumbing.jpg\" alt=\"\" width=\"1200\" height=\"800\" /></p>\n\n<h2 id=\"benefits\">Benefits</h2>\n\n<p>Choosing Imlay Plumbing means we back our work. Our motto is “Quality Service Guaranteed!” If you are not happy with the results, we will come back and ensure you feel confident about the results. We also offer a 1-year guarantee on our work, so you can rest easy knowing that the job is done right the first time!</p>\n\n<p><strong>Examples of services we can perform:</strong></p>\n\n<ul>\n  <li>Repair and install plumbing fixtures</li>\n  <li>Repair/replace leaky water &amp; drain pipes</li>\n  <li>Clean plugged &amp; slow draining pipes</li>\n  <li>Water softeners &amp; conditioners</li>\n  <li>Locate and repair gas leaks</li>\n  <li>Replace garden hose bibbs</li>\n  <li>Diagnose, repair, and replace water heaters</li>\n  <li>Diagnose, repair, and install sump pumps</li>\n  <li>Service and repair well water systems</li>\n  <li>Toilet &amp; urinal installation and repair</li>\n  <li>After-hours, weekend, holiday emergencies</li>\n  <li>Reverse osmosis drinking water systems</li>\n</ul>\n","url":"/service/general-plumbing","relative_path":"_services/2021-01-05-general-plumbing.md","permalink":null},{"draft":false,"categories":[],"layout":"service","date":"2021-01-05 19:20:35 -0700","title":"Water Softening & Treatment","subtitle":"We install softeners, filters, RO, and other water treatment systems.","image":"/uploads/water-softening.jpg","slug":"water-softening-treatment","ext":".md","tags":[],"excerpt":"<h1 id=\"water-softening--treatment\">Water Softening &amp; Treatment</h1>\n","content":"<h1 id=\"water-softening--treatment\">Water Softening &amp; Treatment</h1>\n\n<p>Imlay Plumbing services and installs water treatment solutions. When a new home is built, it is often plumbed with a “softener loop” that allows treated water to flow to fixtures. However, we also offer water conditioning systems. Customers can still enjoy many of the benefits of softened water without the significant cost of re-plumbing the house. We also install reverse osmosis (RO) systems for pure, healthy drinking water! We can take a look at your unique situation and make a recommendation based on your needs.</p>\n\n<h2 id=\"benefits\">Benefits</h2>\n\n<p>Softer water is better all around! Water is called “hard water” if it contains excessive amounts of certain minerals, particularly calcium and magnesium, because these substances leave a hard scale on surfaces that come in contact with the water. You can tell you have hard water if there’s build-up on your sinks and bathtubs, or if you have to use large amounts of soap to clean dishes or wash your hair. It also allows your water heater to heat up quicker and prolongs its useful life by reducing scale buildup inside the unit!</p>\n\n<p><strong>Water Softener</strong></p>\n\n<p>A traditional water softening system uses a filter element combined with a brine tank. The filter contains ionizing “beads” that bind to the minerals in the water and remove them from the incoming water supply. The brine tank is filled with salt every few months and is used during the softeners self-cleaning cycle to wash and flush the buildup of minerals inside the filter. This is the cheapest and most effective method for softening a home’s water supply. We recommend that the home be plumbed with a softener loop before installing this type of system.</p>\n\n<p><img src=\"/uploads/water-softening-1.jpg\" alt=\"\" title=\"Traditional Water Softener\" width=\"1024\" height=\"1024\" /></p>\n\n<p><strong>Salt-Free Water Treatment</strong></p>\n\n<p>For homes not plumbed for soft water, we can install Nuvo H20 systems to help treat the water with a citrus filter that helps reduce scale buildup on fixtures. More information about these types of filters can be found on the <a href=\"https://nuvoh2o.com\" target=\"_blank\" rel=\"noopener\">Nuvo website</a>.</p>\n\n<p><img src=\"/uploads/water-softening-2.png\" alt=\"\" title=\"Salt-Free Water Softener\" width=\"710\" height=\"947\" /></p>\n\n<p><strong>Reverse Osmosis (RO) Purified Water</strong></p>\n\n<p>Additionally, a Reverse Osmosis (RO) system using a series of filters reduces many microscopic impurities and chemical elements. It is also the only type of drinking water treatment that fully removes fluoride from the water.</p>\n\n<ul>\n  <li>Cleaner sinks, bathtubs, fixtures and tile</li>\n  <li>Cleaner, brighter laundry</li>\n  <li>Less time &amp; soap spent scrubbing the kitchen and bathroom</li>\n  <li>Smoother, shinier skin and hair</li>\n  <li>Convenient, better tasting drinking water</li>\n  <li>Use less coffee grounds and juice concentrate</li>\n  <li>Reduce scale in fixtures, appliances</li>\n  <li>Clear, refreshing ice cubes</li>\n</ul>\n\n<p><img src=\"/uploads/water-softening-3.jpeg\" alt=\"\" width=\"1843\" height=\"1920\" /></p>\n","url":"/service/water-softening-treatment","relative_path":"_services/2021-01-06-water-softening-treatment.md","permalink":null},{"draft":false,"categories":[],"layout":"service","date":"2021-01-07 20:20:35 -0700","title":"Water Heating","subtitle":"We install and service both tank and tankless heating systems.","image":"/uploads/water-heating.jpg","slug":"water-heating","ext":".md","tags":[],"excerpt":"<h1 id=\"water-heating\">Water Heating</h1>\n","content":"<h1 id=\"water-heating\">Water Heating</h1>\n\n<p>Who doesn’t love hot water? Whether its a hot shower, washing dishes, a gentle car wash, or taking a hot bath at the end of a long day, we have solutions to make sure the system is properly planned for the demand you place on it. Our plumbers will consult to ensure you get the proper sized system so the hot water doesn’t run out when family and friends come visit.</p>\n\n<p>Running out of hot water in the middle of a shower isn’t always fun. We can troubleshoot your old water heater and make an honest suggestion on whether replacement or repair is the best path forward. We will also flush and service your water heater to prolong its life. We aim to take care of our customers demands for hot water and ensure it never runs out.</p>\n\n<h2 id=\"tank-vs-tankless-water-heaters\">Tank vs Tankless Water Heaters</h2>\n\n<p><strong>Tank Water Heaters</strong></p>\n\n<p>Tanked water heaters tend to cost quite a bit less, require little to no maintenance, and are usually cheaper and easier to repair. They also fit with most existing houses’ venting. Tankless units require special venting that adds additional cost to run on top of the unit itself which costs around twice as much. Additionally, tankless heaters can struggle when many fixtures are run at once since they can only produce so much hot water at a time.</p>\n\n<ul>\n  <li>Cheap up front cost, high compatibility</li>\n  <li>Little to no maintenance, easy repairs</li>\n  <li>Low instantaneous power requirement</li>\n  <li>Better at handling simultaneous usage</li>\n</ul>\n\n<p><img src=\"/uploads/water-heating-3.jpeg\" alt=\"\" width=\"1440\" height=\"1920\" /></p>\n\n<p><strong>Tankless Water Heaters</strong></p>\n\n<p>However, converting your water heater to a tankless model is a valuable upgrade for any home. These units last longer, use less energy, offer endless hot water and <em>can</em> reduce utility bills.</p>\n\n<p>While tankless water heaters are the new trend right now, we still recommend traditional tank water heaters in most cases.</p>\n\n<p>Tankless heaters can have many advantages for the right household. We will happily come consult with you and make the recommendation that fits your unique situation best.</p>\n\n<ul>\n  <li>Heats only when needed, saving energy</li>\n  <li>Can last up to 20 years with regular service</li>\n  <li>Takes up less space</li>\n  <li>Hot water doesn’t ever run out</li>\n</ul>\n\n<p><img src=\"/uploads/water-heating-2.jpg\" alt=\"\" width=\"768\" height=\"768\" /></p>\n\n<h3 id=\"boilers--radiant-heat-systems\">Boilers &amp; Radiant Heat Systems</h3>\n\n<p>Imlay Plumbing can perform basic services for boiler and radiant heat systems. For more advanced troubleshooting, give us a call and we can happily refer someone who specializes in these systems.</p>\n\n<p><img src=\"/uploads/water-heating-1.jpeg\" alt=\"\" width=\"1200\" height=\"900\" /></p>\n","url":"/service/water-heating","relative_path":"_services/2021-01-08-water-heating.md","permalink":null},{"draft":false,"categories":[],"layout":"service","date":"2021-01-08 21:20:35 -0700","title":"Drain Cleaning & Inspection","subtitle":"Have a clogged drain or toilet? We have a wide variety of drain cleaning tools and equipment to get the job done right.","image":"/uploads/drain-cleaning.jpeg","slug":"drain-cleaning-inspection","ext":".md","tags":[],"excerpt":"<h1 id=\"drain-cleaning--inspection\">Drain Cleaning &amp; Inspection</h1>\n","content":"<h1 id=\"drain-cleaning--inspection\">Drain Cleaning &amp; Inspection</h1>\n\n<p>If you have a slow or plugged drain, we are here to help. We understand the frustration of not being able to use your plumbing systems and the mess created when you have a backup. Our plumbers are provided with a wide assortment of tools and equipment to get your sewer flowing agin and can also provide a camera inspection to identify problems with the drain pipes. We can diagnose, clean, and repair, depending on your unique situation.</p>\n\n<p> </p>\n\n<h2 id=\"clogged-drains\">Clogged Drains</h2>\n\n<p>Roots and buildup can slow down or even block your fixtures from draining properly. When this happens we frequently see hazardous backups. Sewer maintenance from Imlay Plumbing can save you serious money in the long run by preventing costly repairs or pipe replacements. </p>\n\n<p><strong>Examples of clogs:</strong></p>\n\n<p> </p>\n\n<ul>\n  <li>Kitchen and bar sink drains due to soap, grease, and food buildup</li>\n  <li>Bathroom sink/tub/shower drains due to hair, soap, and oil buildup</li>\n  <li>Weak flushing toilets from toilet paper, wipes, and scale buildup</li>\n  <li>Floor drains from dirt, rocks, and debris or other foreign objects</li>\n  <li>Washing machine drains from detergent, oil, and suds buildup</li>\n</ul>\n\n<p><strong>Equipment we use:</strong></p>\n\n<ul>\n  <li>Medium drain snake or sink snake designed for 1.5” to 2” drain lines.</li>\n  <li>Sink snake designed small enough to work its way through p-traps</li>\n  <li>Main line snake designed for clearing tough clogs and roots in larger pipes</li>\n  <li>Hyrdo-jetter acting like a pressure washer to clean constricted, greasy pipes</li>\n  <li>Milwaukee AirSnake™ to break up hardened clogs in toilets, floor drains, and urinals</li>\n</ul>\n\n<p><img src=\"/uploads/drain-cleaning-1.jpg\" alt=\"\" width=\"640\" height=\"625\" /></p>\n\n<h2 id=\"camera-inspections\">Camera Inspections</h2>\n\n<p>Sometimes replacing or repairing the line is the best way forward. Old sewer lines can build up with grease, hair, scale and mineral buildup, and other foreign objects. Root invasion is another common culprit of backups. This is especially common in older homes with galvanized, cast iron, clay, and orangeburg sewer lines.</p>\n\n<p>We will modernize your sewer system by replacing old, broken, squashed, and rusted pipes with new, strong, and smooth-walled schedule 40 PVC. We avoid using thin walled SDR drain pipe commonly used to save a few dollars because it ends up costing customers tens of thousands to inevitably replace it when it fails. We always prioritize doing the job right so it only has to be done once.</p>\n\n<p><img src=\"/uploads/drain-cleaning-2.jpeg\" alt=\"\" width=\"1500\" height=\"941\" /></p>\n","url":"/service/drain-cleaning-inspection","relative_path":"_services/2021-01-09-drain-cleaning-inspection.md","permalink":null},{"draft":false,"categories":[],"layout":"service","date":"2021-01-09 21:30:35 -0700","title":"Plumbing Design","subtitle":"Let us help design your plumbing system on new construction and remodels.","image":"/uploads/plumbing-design.jpg","slug":"plumbing-design","ext":".md","tags":[],"excerpt":"<h1 id=\"plumbing-design\">Plumbing Design</h1>\n","content":"<h1 id=\"plumbing-design\">Plumbing Design</h1>\n\n<p>Imlay Plumbing is available to plan and build your project, whether it is residential or commercial. New construction, remodels, demolition, excavation, you name it. We aim to do everything in house so you have a one-stop shop to rely on when scheduling out your subcontractors for any project. Save a bunch of scheduling headache by having our crews meet your goals and timelines.</p>\n\n<p><img src=\"/uploads/plumbing-design-1.jpg\" alt=\"\" width=\"1920\" height=\"1280\" /></p>\n\n<p> </p>\n\n<h2 id=\"imlay-plumbing-excavation-and-blackstar-works\">Imlay Plumbing, Excavation, and Blackstar Works</h2>\n\n<p>We are currently working toward offering an in-house solution for any construction from start to finish. From a general contractor, excavation crew, plumbing, electrical, and beyond…our goal is to save our clients time and money by having the ability to handle everything under one roof. We will provide a truly one-of-a-kind solution for Cedar City and Iron County as a whole. Our competition simply can’t offer the same level of services.</p>\n\n<p> </p>\n\n<ul>\n  <li>New &amp; existing construction</li>\n  <li>Remodels and unfinished basements</li>\n  <li>Commercial projects</li>\n  <li>Residential projects</li>\n  <li>Excavation and dirt work</li>\n  <li>Digging footings, crawl spaces, etc.</li>\n  <li>Ground rough, rough ins, and set finish</li>\n  <li>General Contracting - coming soon!</li>\n</ul>\n","url":"/service/plumbing-design","relative_path":"_services/2021-01-10-plumbing-design.md","permalink":null},{"draft":false,"categories":[],"layout":"service","date":"2021-01-10 21:40:35 -0700","title":"Sewer Line Replacement","subtitle":"If your main sewer is damaged or clogged we can help. We can repair or replace with newer, stronger, and more root resistant Schedule 40 PVC.","image":"/uploads/sewer-replacement.jpg","slug":"sewer-line-replacement","ext":".md","tags":[],"excerpt":"<h1 id=\"sewer-line-replacement\">Sewer Line Replacement</h1>\n","content":"<h1 id=\"sewer-line-replacement\">Sewer Line Replacement</h1>\n\n<p>Having a sewer backup is a very stressful and panic inducing situation. Imlay Plumbing is here to help. Cedar City has a lot of older mid-century homes with aging clay, orangeburg, and cast iron sewer lines that love to deform, separate, and break. This allows roots to enter the pipe and proliferate rapidly, wreaking havoc! We have a skilled team that specializes in replacing sewer lines.</p>\n\n<p><img src=\"/uploads/sewer-replacement-1.jpeg\" alt=\"\" width=\"800\" height=\"474\" /></p>\n\n<p>Replacing an old sewer line that is beyond its useful life is one of the best investments you can make in your home. We only use schedule 40 PVC when installing the new line. Many builders today go cheap with “SDR” which is a thin walled plastic pipe that is subject to being crushed when the dirt is filled and compacted back over it. It’s a cheap pipe that saves a few dollars at the expense of the homeowner in the long run. Imlay Plumbing has the knowledge and expertise to watch out for your best interest so you know you’re getting a permanent, quality fix.</p>\n\n<p>We will run our sewer camera and determine if the entire line needs replacement, or, in some cases only a spot fix is required. Sometimes the line is bad out in the street and breaking into the asphalt is required. Whatever the case is, we will do all the legwork and do our best to get you back in service as quickly as possible.</p>\n\n<p>Benefits of a new PVC plastic sewer line</p>\n\n<ul>\n  <li>Corrosion Resistance</li>\n  <li>Chemical resistance</li>\n  <li>Reduced failures and blockages</li>\n  <li>Smooth bore allows high flow rates</li>\n  <li>Leak-free joints</li>\n  <li>Quicker installation time</li>\n  <li>Flexes under load (resists breakage)</li>\n  <li>Tried and true repair method</li>\n  <li>Low cost &amp; long service life</li>\n  <li>Highly resistant to root intrusion</li>\n</ul>\n\n<p><a href=\"https://youtu.be/Sw7T28dCin0\" title=\"Why to use quality pipes.\"><img src=\"/uploads/sewer-replacement-thumbnail.jpeg\" alt=\"Why to use quality pipes.\" /></a></p>\n\n<p>This video illustrates the different strengths of commonly used PVC thicknesses for wastewater drainage. We believe this illustrates perfectly why we avoid using the commonly used SDR/thin wall pipes used in so many new homes today. Schedule 40 PVC is the pipe on the right, and is what we use.</p>\n\n<p>We can also replace water mains! Contact us for a quote.</p>\n","url":"/service/sewer-line-replacement","relative_path":"_services/2021-01-11-sewer-line-replacement.md","permalink":null}],"testimonials":[{"draft":false,"categories":[],"layout":"default","name":"Amy Kartchner Bates","position":null,"image":"/uploads/customer-amy.jpg","blurb":"So impressed/grateful for Imlay plumbing! We had emergency after hours (day before first day of school no less) and they sent Kadin out to help us! He was so friendly and nice (even with my kids trying to \"help\" him) and with the late night. Very professional and helpful!","_hide_content":true,"title":"Amy Kartchner Bates","slug":"amy-kartchner-bates","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/amy-kartchner-bates.html","relative_path":"_testimonials/amy-kartchner-bates.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Anna McFadden","position":null,"image":"/uploads/customer-ana.png","blurb":"Imlay came out as soon as they could and succeeded where another Plumber failed. They saved our landlord thousands by telling us the correct problem and what would need to be done! I highly suggest you call Imlay if you need help, and if they can’t help you they will tell you who can. They are honest and they are now my go to plumber!","title":"Anna Mcfadden","slug":"anna-mcfadden","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/anna-mcfadden.html","relative_path":"_testimonials/anna-mcfadden.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"James Riley","position":null,"image":"/uploads/customer-man.jpeg","blurb":"Came to the rescue when my main line failed.  It took a while to identify the issues and a couple of days to repair.  Excavation crew was efficient and courteous. Easy 5 stars.","title":"James Riley","slug":"james-riley","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/james-riley.html","relative_path":"_testimonials/james-riley.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"John Wardenburg","position":null,"image":"/uploads/customer-john.jpg","blurb":"Had an emergency and Imlay plumbing came to the rescue. They were on time in showing up to the house, professional in every way! I would recommend them for any plumbing needs!","_hide_content":true,"title":"John Wardenburg","slug":"john-wardenburg","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/john-wardenburg.html","relative_path":"_testimonials/john-wardenburg.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Pat Wall","position":null,"image":"/uploads/customer-woman.jpeg","blurb":"We had a pipe burst in our wall at 4:45 this morning. I called their number at 7:30AM, Spencer showed up at 9:30, removed our water heater, diagnosed and fixed the broken pipe, and was on his way by 10:45! His services were greatly appreciated on a Saturday morning! Imlay Plumbing now has a customer for life!","_hide_content":true,"title":"Pat Wall","slug":"pat-wall","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/pat-wall.html","relative_path":"_testimonials/pat-wall.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Susan Christiansen","position":null,"image":"/uploads/customer-woman-2.jpeg","blurb":"We are having our shower redone. Cam was completing the project. He was wonderful to work with. Very courteous, professional and detail oriented. The job was done professionally and on time. And the cleanup was spotless.  So glad we chose to Imlay Plumbing do our project. Will use them for all our plumbing needs. Thanks again Cam for a job well done.","title":"Susan Christiansen","slug":"susan-christiansen","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/susan-christiansen.html","relative_path":"_testimonials/susan-christiansen.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"K Vochatzer","position":null,"image":"/uploads/customer-k.png","blurb":"Kasey and Kadin at Imlay Plumbing treated me with courtesy and respect. They went beyond the expected in my situation to give honest advice on what was necessary and what was not for my septic system. They even found me a  concrete lid to replace mine that disintegrated. Thank you Imlay!","title":"Tatiana","slug":"tatiana","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/tatiana.html","relative_path":"_testimonials/tatiana.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Tiffany Chavez","position":null,"image":"/uploads/customer-tiffany.jpg","blurb":"Super professional, friendly, very clean. Cleaned up so well you wouldn't have known they were even there. Fixed out water issues and even took the time to see if my cat had snuck into their truck after they left and I couldn't find him! Super caring company, honest and professional. I have nothing but good to say about them.","_hide_content":true,"title":"Tiffany Chavez","slug":"tiffany-chavez","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/testimonials/tiffany-chavez.html","relative_path":"_testimonials/tiffany-chavez.md","permalink":null}],"team":[{"draft":false,"categories":[],"layout":"default","name":"Alex Cajas","position":"Plumber","image":"/uploads/team-alex.jpg","blurb":null,"_hide_content":true,"title":"Alex Cajas","slug":"alex-cajas","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/alex-cajas.html","relative_path":"_team/alex-cajas.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Angie Imlay","position":"Office Manager","image":"/uploads/team-angie.jpg","blurb":null,"_hide_content":true,"title":"Angie Imlay","slug":"angie-imlay","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/angie-imlay.html","relative_path":"_team/angie-imlay.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Austin Adams","position":"Plumber","image":"/uploads/team-austin.jpg","blurb":null,"_hide_content":true,"title":"Austin Adams","slug":"austin-adams","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/austin-adams.html","relative_path":"_team/austin-adams.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Cam Tullis","position":"Plumber","image":"/uploads/team-cam.jpg","blurb":null,"_hide_content":true,"title":"Cam Tullis","slug":"cam-tullis","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/cam-tullis.html","relative_path":"_team/cam-tullis.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Dave Nielsen","position":"Plumber","image":"/uploads/team-dave.jpg","blurb":null,"_hide_content":true,"title":"Dave Nielsen","slug":"dave-nielsen","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/dave-nielsen.html","relative_path":"_team/dave-nielsen.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"D'var Bulloch","position":"Shop Manager","image":"/uploads/team-dvar.jpg","blurb":null,"_hide_content":true,"title":"Dvar Bulloch","slug":"dvar-bulloch","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/dvar-bulloch.html","relative_path":"_team/dvar-bulloch.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Justin Rees","position":"Plumber","image":"/uploads/team-justin.jpg","blurb":null,"_hide_content":true,"title":"Justin Rees","slug":"justin-rees","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/justin-rees.html","relative_path":"_team/justin-rees.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Kadin Imlay","position":"Owner","image":"/uploads/team-kadin.jpg","blurb":null,"title":"Kadin Imlay","slug":"kadin-imlay","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/kadin-imlay.html","relative_path":"_team/kadin-imlay.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Kasey Nielson","position":"Billing Manager","image":"/uploads/team-kasey.jpg","blurb":null,"_hide_content":true,"title":"Kasey Nielson","slug":"kasey-nielson","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/kasey-nielson.html","relative_path":"_team/kasey-nielson.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Kiley Bentley","position":"Plumber","image":"/uploads/team-kiley.jpg","blurb":null,"_hide_content":true,"title":"Kiley Bentley","slug":"kiley-bentley","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/kiley-bentley.html","relative_path":"_team/kiley-bentley.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Lex Nielson","position":"Plumbing Manager","image":"/uploads/team-lex.jpg","blurb":null,"_hide_content":true,"title":"Lex Nielson","slug":"lex-nielson","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/lex-nielson.html","relative_path":"_team/lex-nielson.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Spencer Deal","position":"Plumber","image":"/uploads/team-spencer.jpg","blurb":null,"_hide_content":true,"title":"Spencer Deal","slug":"spencer-deal","ext":".md","tags":[],"excerpt":"\n","date":"2022-03-08 20:20:21 -0700","content":"\n","url":"/team/spencer-deal.html","relative_path":"_team/spencer-deal.md","permalink":null}],"data":{"author":{"author_name":"Imlay Plumbing","author_image":"/uploads/logo-star.png"},"contact_form":{"form_title":"Contact Us","form_description":"Send us a message to get on the schedule, ask plumbing questions, or request a free estimate!","form_submission_email":"dhniels@me.com","form_button_text":"Send now"},"footer":{"footer_menu__settings":{"menu__items":[{"title":"Home","url":"/"},{"title":"Services","url":"/services/"},{"title":"News","url":"/news/"},{"title":"Contact","url":"/contact/"},{"title":"About","url":"/about/"}]},"copyright_text_html":"<p>2021 &copy; <a href=\"/\">Imlay Plumbing</a>. Built with <a href=\"https://cloudcannon.com/\">CloudCannon</a>.</p>"},"general_settings":{"title":"Imlay Plumbing","description":"Quality Service Guaranteed!","social_media_share_image":"/uploads/logo-plumbing-square-black.png","disqus-identifier":null,"google-analytics":null},"navigation":{"logo_image":"/uploads/logo-plumbing-wide-transparent-alt.png","menu__settings":{"menu__items":[{"title":"Home","url":"/"},{"title":"Services","submenu":[{"url":"/services/","title":"All Services"},{"url":"/service/general-plumbing","title":"General Plumbing"},{"url":"/service/water-softening-treatment","title":"Water Softening & Treatment"},{"url":"/service/water-heating","title":"Water Heating"},{"url":"/service/drain-cleaning-inspection","title":"Drain Cleaning & Inspection"},{"url":"/service/plumbing-design","title":"Plumbing Design"},{"url":"/service/sewer-line-replacement","title":"Sewer Line Replacement"}]},{"title":"News","url":"/news/"},{"title":"Contact","url":"/contact/"},{"title":"About","url":"/about/"}]}},"newsletter":{"newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"},"social_links":{"social":[{"icon":"Facebook","link":"https://www.facebook.com/imlayplumbing"},{"icon":"Instagram","link":"https://www.instagram.com/imlayplumbing/"}]}},"baseurl":null,"title":"Imlay Plumbing"}}